EmcraftSystems/linux-upstream/include/dt-bindings/reset/lpc17xx-resets.h
/*
 * Copyright (C) 2017 Emcraft Systems
 * Sergei Miroshnichenko <sergeimir@emcraft.com>
 *
 * License terms:  GNU General Public License (GPL), version 2
 */
#ifndef __DT_BINDINGS_RESET_LPC17XX_H__
#define __DT_BINDINGS_RESET_LPC17XX_H__

#define RST_LCD		0
#define RST_TIM0	1
#define RST_TIM1	2
#define RST_UART0	3
#define RST_UART1	4
#define RST_PWM0	5
#define RST_PWM1	6
#define RST_I2C0	7
#define RST_UART4	8
#define RST_RTC		9
#define RST_SSP1	10
#define RST_EMC		11
#define RST_ADC		12
#define RST_CAN1	13
#define RST_CAN2	14
#define RST_GPIO	15
#define RST_SPIFI	16
#define RST_MCPWM	17
#define RST_QEI		18
#define RST_I2C1	19
#define RST_SSP2	20
#define RST_SSP0	21
#define RST_TIM2	22
#define RST_TIM3	23
#define RST_UART2	24
#define RST_UART3	25
#define RST_I2C2	26
#define RST_I2S		27
#define RST_SDC		28
#define RST_GPDMA	29
#define RST_ENET	30
#define RST_USB		31
#define RST_IOCON	32
#define RST_DAC		33
#define RST_CANACC	34
#define RST_END		35

#endif /* __DT_BINDINGS_RESET_LPC17XX_H__ */
